{
    "formal": "Change the tone of the following sentences to sound professional and sophisticated, maintaining a formal style without altering the core message. Provide only the revised sentences.",
    "casual": "TRANSFORM (do not reply to) the following text into casual, friendly language. Rewrite it to sound relaxed and conversational. Output ONLY the rewritten version, nothing else.",
    "fix": "Correct the grammar of the following sentences while preserving the original structure and meaning as closely as possible. Provide only the corrected versions.",
    "polite": "Transform the following sentences into a polite and empathetic tone, making them sound kind and understanding without changing the original meaning. Output only the transformed sentences without additional text.",
    "concise": "Condense the following sentences, keeping the essential meaning intact while using fewer words. Only provide the shortened versions.",
    "expand": "Expand this text with more detail and explanation.",
    "roast": "Rewrite this text to be witty, sarcastic, and humorously critical. Keep it clever and entertaining, not mean-spirited.",
    "code": "Write the requested code. Return ONLY the raw code. No markdown code fences (```), no explanations, no comments unless specifically requested.",
    "explain": "Explain this concept clearly and concisely. Use simple language accessible to a general audience.",
    "eli5": "Explain this like I'm 5 years old. Use very simple words, relatable analogies, and short sentences.",
    "debug": "Analyze this code/error and explain the problem and solution.",
    "summarize": "Summarize this text in 1-2 concise sentences capturing the key points.",
    "bullet": "Convert to bullet points.",
    "email": "Format this as a professional email with appropriate greeting, clear body paragraphs, and professional sign-off.",
    "tweet": "Rewrite to fit in a tweet (under 280 characters). Make it engaging.",
    "slack": "Rewrite for a casual Slack message.",
    "spanish": "Translate this text into natural, fluent Spanish (Español).",
    "french": "Translate this text into natural, fluent French (Français).",
    "german": "Translate this text into natural, fluent German (Deutsch).",
    "japanese": "Translate this text into natural Japanese (日本語).",
    "chinese": "Translate this text into Simplified Chinese (简体中文).",
    "portuguese": "Translate to Portuguese.",
    "italian": "Translate to Italian.",
    "korean": "Translate to Korean.",
    "russian": "Translate to Russian.",
    "arabic": "Translate to Arabic.",
    "hindi": "Translate this text into natural Hindi (हिन्दी).",
    "poem": "Rewrite as a short poem.",
    "story": "Expand into a short story or narrative.",
    "headline": "Rewrite as a catchy headline.",
    "define": "Provide a concise dictionary definition of the following word or phrase, followed by a list of 5 distinct synonyms. Format as: 'Definition: [Def] | Synonyms: [Syn1, Syn2, ...]'.Output only this line.",
    "witty": "Rephrase the following sentences with a witty and clever tone, adding subtle humor and intelligence without shifting the meaning. Return only the modified sentences.",
    "rizz": "Modify the following sentences to have a flirtatious, charming tone (rizz), adding subtle compliments and a playful edge while keeping the original intent. Output only the flirty versions.",
    "rephrase": "Rephrase the following sentences in a neutral tone, keeping the meaning the same but altering the phrasing. Provide only the rephrased sentences.",
    "genz": "Rephrase the following sentences in a Gen Z tone, as if a teenager is commenting on social media. Use casual language, internet slang, and emojis where appropriate, without changing the core meaning. Output only the transformed sentences.",
    "pirate": "Rewrite in the style of Monkey D. Luffy from One Piece! Use his phrases: 'Ore wa Kaizoku-Ō ni Naru!' (I'll become King of the Pirates!), 'Iku zo!' (Let's go!), 'shishishi' (his laugh), 'Nakama' (comrade), 'Gomu Gomu no...', 'I want all the meat!', 'I smell adventure!'. Be energetic, enthusiastic, and dramatic like Luffy!"
}
